In [7]:
# https://leetcode.com/problems/second-highest-salary

In [8]:
import numpy as np
import pandas as pd
from io import StringIO

In [9]:
def md_df(md_str: str):
    return pd.read_csv(
        StringIO(md_str.replace(' ', '').replace('-','').strip().strip('|')),  # Get rid of whitespaces
        sep='|'
    ).dropna(
        axis=1,
        how='all'
    )

In [56]:
def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    tmp = employee.nlargest(2, 'salary').drop_duplicates('salary')
    if len(tmp) < 2:
        return pd.DataFrame({
            "SecondHighestSalary": [None]
        })
    
    return pd.DataFrame({
            "SecondHighestSalary": [tmp.iloc[1]['salary']]
        })

In [60]:
data_employee_1="""
| id | salary |
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |
"""
data_employee_2="""
| id | salary |
| 1  | 100    |
|
"""
data_employee_3="""
| id | salary |
| 1  | 100    |
| 2  | 100    |
| 3  | 50     |
"""

employees_1 = md_df(data_employee_1)

print("employees_1")
display(employees_1)

employees_2 = md_df(data_employee_2)

print("employees_2")
display(employees_2)


employees_3 = md_df(data_employee_3)

print("employees_3")
display(employees_3)

employees_1

     id  salary
NaN   1     100
NaN   2     200
NaN   3     300

employees_2

     id  salary
NaN   1     100

employees_3

     id  salary
NaN   1     100
NaN   2     100
NaN   3      50

In [57]:
second_highest_salary(employees_1)

   SecondHighestSalary
0                  200

In [58]:
second_highest_salary(employees_2)

  SecondHighestSalary
0                None

In [61]:
second_highest_salary(employees_3)

  SecondHighestSalary
0                None

In [64]:
employees_3.drop_duplicates('salary').nlargest(2, 'salary')

     id  salary
NaN   1     100
NaN   3      50